# PathReinNumberOfBars Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathReinNumberOfBars Property
ParameterTypeId Class See Also
---
"Number Of Bars"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathReinNumberOfBars { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathReinNumberOfBars As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathReinNumberOfBars {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace